// 1. async - браузер загрузить і виконає код всередені асинхронно,
// не чекаючи загрузки всієї сторінки
// defer - не буде виконано поки не загрузится решта сторінки
// console.log('From index')

//2.  kebab-case - property-name
// let obj = {
// 	['property-kebab-style']: 'Danny',
// }

// console.log(obj['property-kebab-style'])

// Повторення, сплив змінних

// Типи данних, typeof:

// Примітивні типи:

// Посилальний тип:

// Шаблонні рядки та конкатенація:

// Математичні оператори:

// Оператори порівняння:

// Логічні оператори:

// Скорочені оператори:

// Унарні оператори:

// Пріоритет операторів:

// Приведення типів(явне, неявне):

// Github
